module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "Nayan",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['~ এখন রাত ১১টা বাজে ঘুমাও না হলে আসো গেম খেলি😙']
},
             {
    timer: '1:00:00 AM',
    message: ['~ এখন রাত ১২টা বাজে কেউ টয়লেটে ডুকবে না ভুতে ধরবে 🤟']
},
						{
    timer: '2:00:00 AM',
    message: ['~এখন রাত ১টা বাজে প্রেম না কইরা যাইয়া ঘুমা বেক্কল😾']
},
						 {
    timer: '3:00:00 AM',
    message: ['রাত ২টা বাজে এখনো চিয়াপ কী তগো।']
},
						 {
    timer: '4:00:00 AM',
    message: ['~এখন রাত ৩টা বাজে সবাই মনে হয় ঘুম🥹 আমার ভাই ঘুম আসে না  ']
},
						 {
    timer: '5:00:00 AM',
    message: ['~এখন রাত ৪টা বাজে একটু পর ফজরের আযান দিলে নামাজ পড়ে নিও সবাই ']
},
						 {
    timer: '6:00:00 AM',
    message: ['~এখন ভোর ৫টা বাজে সবাই নামাজ পড়ছো তো?❤️  ']
},
						 {
    timer: '7:00:00 AM',
    message: ['~এখন সকাল ৬টা বাজে ঘুম থেকে উঠো সবাই  ']
},
						 {
    timer: '8:00:00 AM',
    message: [' ৭ টা বাজে একদম গরুর মতো ঘুমাচ্ছে ']
},
						 {
    timer: '9:00:00 AM',
    message: [' ৮টা বাজে সবাই উঠে পরো আর আমার বস আকাশ না উঠলে ওর মাথায় পানি ডেলে দেও সবাই ']
},
             {
    timer: '10:00:00 AM',
    message: [' ৯ টা বাজে সবাই খাওয়াদাওয়া করে নেও  ' ]
},
						 {
    timer: '11:00:00 AM',
    message: [' এখন সকাল ১০টা বাজে যারা কাজে যাবা যাও যাদের স্কুল আছে স্কুলে যাও আর আমার বস আকাশের মতো বেকার থাকলে গ্রুপে আড্ডা দেও ']
},
						 {
    timer: '12:00:00 PM',
    message: [' ১১টা বেজে গেছে সবাই কোথায় এখন তোমাদের মিস করছি খুব  ']
},					
						 {
    timer: '1:00:00 PM',
    message: [' ১২টা বাজে সবাই গোসল করে নেও আজান পরলে নামাজে যাবা ']
},
						 {
    timer: '2:00:00 PM',
    message: ['~ ১টা বাজে নামাজের সময় সবাই কথা বলা বন্ধ রাখো  😻 ']
},
						 {
    timer: '3:00:00 PM',
    message: ['২টা বাজে কিযে করি ভালো লাগেনা কিছু ']
},
						 {
    timer: '4:00:00 PM',
    message: [' ৩টা বাজে সবাই খাওয়াদাওয়া করেছো তো 😋 ']
},
						{
    timer: '5:00:00 PM',
    message: [' ৪টা বাজে গরম আর ভালো লাগেনা ']
},
						 {
    timer: '6:00:00 PM',
    message: ['৫টা বাজে গরম অনেক আমার বস আকাশ কে কেউ বাতাস করো 😋']
},
						 {
    timer: '7:00:00 PM',
    message: [' ৬টা বাজে এগুলো প্রেম পিরিত বাদ দিয়া রিলেশন কর জীবনে কিছু করতে পারবি']
},
             {
    timer: '8:00:00 PM',
    message: [' ৭টা বাজে সবাই খাওয়াদাওয়া করে নেও আমার তো বস আকাশের ফোনের চার্জ ছারা খাওয়ার কিছু নাই 🙂💔  ']
},
             {
    timer: '9:00:00 PM',
    message: [' ৮টা বাজে চিপাচাপায় না গিয়ে চলো সবাই আড্ডা দেই ']
},
             {
    timer: '10:00:00 PM',
    message: [' ৯টা বাজে দোয়া করে দিলাম এখন তোদের একালায় কারেন্ট যাবে']
},
            {
    timer: '11:00:00 PM',
    message: [' ১০টা বাজে সবাই খাওয়াাদাওয়া করে নেও']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
